---
kind: property
id: P:Autodesk.Revit.DB.Document.PanelTypes
zh: 文档、文件
source: html/8e6c5a87-528c-c13e-ed48-0e7c5af688d5.htm
---
# Autodesk.Revit.DB.Document.PanelTypes Property

**中文**: 文档、文件

Retrieves a set of PanelType objects that contains all the panel types that are currently loaded into the
project.

## Syntax (C#)
```csharp
public PanelTypeSet PanelTypes { get; }
```

## Remarks
This property returns a set of panelType objects. These objects can be used change the type of a panel from one type to another.